[Killed] BlockStatement
modules/admin/services/sign-in.service.ts:18:37
 		private jwtService: JwtService
 	) {}
 
-	async execute(user: SignInUserDTO) {
-		const checkIfUserExists = await this.userRepository.findCredentialsByEmail(user.email)
-
-		if (!checkIfUserExists) {
-			throw new InvalidCredentialsError()
-		}
-
-		const doesPasswordMatch = await compare(user.password, checkIfUserExists.password)
-
-		if (!doesPasswordMatch) {
-			throw new InvalidCredentialsError()
-		}
-
-		const accessToken = this.jwtService.sign(
-			{ sub: checkIfUserExists.id, role: checkIfUserExists.role },
-			{ expiresIn: this.configService.get('JWT_EXPIRES_IN') }
-		)
-
-		return {
-			accessToken
-		}
-	}
+	async execute(user: SignInUserDTO) {}
 }
 
statusReason: expected undefined to deeply equal ObjectContaining{…}

[Killed] BlockStatement
modules/admin/services/sign-in.service.ts:21:27
 	async execute(user: SignInUserDTO) {
 		const checkIfUserExists = await this.userRepository.findCredentialsByEmail(user.email)
 
-		if (!checkIfUserExists) {
-			throw new InvalidCredentialsError()
-		}
+		if (!checkIfUserExists) {}
 
 		const doesPasswordMatch = await compare(user.password, checkIfUserExists.password)
statusReason: expected TypeError: Cannot read properties of null… to be an instance of InvalidCredentialsError

[Survived] StringLiteral
modules/admin/services/sign-in.service.ts:33:40
 
 		const accessToken = this.jwtService.sign(
 			{ sub: checkIfUserExists.id, role: checkIfUserExists.role },
-			{ expiresIn: this.configService.get('JWT_EXPIRES_IN') }
+			{ expiresIn: this.configService.get("") }
 		)
 
