[Killed] BlockStatement
modules/admin/services/register.service.ts:11:40
 export class RegisterService {
 	constructor(private readonly userRepository: UsersRepository) {}
 
-	async execute(user: RegisterAdminDTO) {
-		const checkIfUserExists = await this.userRepository.findByEmail(user.email)
-
-		if (checkIfUserExists) {
-			throw new UserAlreadyExistsError()
-		}
-
-		const hashedPassword = await hash(user.password, 10)
-
-		const userWithHashedPassword = {
-			...user,
-			password: hashedPassword
-		}
-
-		await this.userRepository.create(userWithHashedPassword)
-	}
+	async execute(user: RegisterAdminDTO) {}
 }
 
killedBy: Register Admin User should register an admin user
statusReason: expected [] to have a length of 1 but got +0
