[Killed] BlockStatement
modules/admin/services/delete-by-id.service.ts:9:28
 export class DeleteByIdService {
 	constructor(private readonly userRepository: UsersRepository) {}
 
-	async execute(id: string) {
-		const checkIfUserExists = await this.userRepository.findById(id)
-
-		if (checkIfUserExists) {
-			return await this.userRepository.deleteById(id)
-		}
-
-		throw new UserNotFoundError()
-	}
+	async execute(id: string) {}
 }
 
killedBy: Delete Admin User by ID should delete an admin user by ID
statusReason: expected [ { id: '123', name: 'Admin', …(5) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
modules/admin/services/delete-by-id.service.ts:12:7
 	async execute(id: string) {
 		const checkIfUserExists = await this.userRepository.findById(id)
 
-		if (checkIfUserExists) {
+		if (true) {
 			return await this.userRepository.deleteById(id)
 		}
killedBy: Delete Admin User by ID should not delete a non-existent admin user
statusReason: promise resolved "undefined" instead of rejecting
