[Killed] BlockStatement
modules/admin/services/list.service.ts:8:18
 export class ListService {
 	constructor(private readonly userRepository: UsersRepository) {}
 
-	async execute() {
-		return await this.userRepository.findAll()
-	}
+	async execute() {}
 }
 
killedBy: List Admin Users should list all admin users
statusReason: Target cannot be null or undefined.
