[Killed] BlockStatement
modules/admin/services/update.service.ts:10:38
 export class UpdateService {
 	constructor(private readonly userRepository: UsersRepository) {}
 
-	async execute(user: UpdateAdminDTO) {
-		const checkIfUserExists = await this.userRepository.findById(user.id)
-
-		if (!checkIfUserExists) {
-			throw new UserNotFoundError()
-		}
-
-		await this.userRepository.update(user)
-	}
+	async execute(user: UpdateAdminDTO) {}
 }
 
killedBy: Update Admin User should update an admin user
statusReason: expected 'Admin' to be 'Admin Updated' // Object.is equality

[Killed] BooleanLiteral
modules/admin/services/update.service.ts:13:7
 	async execute(user: UpdateAdminDTO) {
 		const checkIfUserExists = await this.userRepository.findById(user.id)
 
-		if (!checkIfUserExists) {
+		if (checkIfUserExists) {
 			throw new UserNotFoundError()
 		}
killedBy: Update Admin User should update an admin user
statusReason: User not found

[Killed] ConditionalExpression
modules/admin/services/update.service.ts:13:7
 	async execute(user: UpdateAdminDTO) {
 		const checkIfUserExists = await this.userRepository.findById(user.id)
 
-		if (!checkIfUserExists) {
+		if (false) {
 			throw new UserNotFoundError()
 		}
killedBy: Update Admin User should not update an admin user with an invalid id
statusReason: expected Error: User with id invalid-id not found to be an instance of UserNotFoundError
